CREATE TABLE used_product_board(
    BOARD_ID       VARCHAR(5)
  , WRITER_ID     VARCHAR(50)
  , TITLE        VARCHAR(100)	
  , PRICE  			INTEGER
  , CREATED_DATE     DATE
  , STATUS			VARCHAR(10)
);

INSERT INTO used_product_board
VALUES
     ('B0001', 'jyj010530', '캠핑의자', '25000', '2022-11-29', 'SALE')
   , ('B0002', 'jbs8307', '에어컨', '100000' , '2022-11-29', 'SALE')
   , ('B0003', 'jyj3048', '에어팟', '80000'  , '2022-11-26', 'DONE')
   , ('B0004', 'jjy30480', '코트'  , '450000', '2022-11-25', 'DONE')
   , ('B0005', 'jks0924', '포르쉐', '50000000', '2022-11-30', 'SALE')
   , ('B0006', 'goeun02', '어그부츠', '30000' , '2022-11-30', 'SALE')
   , ('B0007', 'tgwon00', '고데기', '20000' , '2022-11-28', 'DONE')
   , ('B0008', 'choeun98', '애플워치'  , '100000'  , '2022-11-27', 'DONE')
   , ('B0009', 'hyojeong02', '아이패드', '300000', '2022-11-26', 'DONE')
   , ('B0010', 'yoojin01', '맥북', '1000000' , '2022-11-27', 'SALE')
   , ('B0011', 'study00', '커피머신', '500000' , '2022-11-26', 'SALE')
   , ('B0012', 'boboo98', '가방'  , '50000'  , '2022-11-30', 'DONE')
   , ('B0013', 'hhhello0', '코스터', '5000' , '2022-11-29', 'DONE')
   , ('B0014', 'bye012', '마우스', '70000'  , '2022-11-25', 'SALE')
;


CREATE TABLE used_product_user(
    USER_ID       VARCHAR(50)
  , NICKNAME     VARCHAR(100)
  , CITY        VARCHAR(100)	
  , TLNO     VARCHAR(20)
);

INSERT INTO used_product_user
VALUES
     ('jks0924', '크크', '성남시', '01036344964')
   , ('goeun02', '고으니', '하남시', '01032777543')
   , ('choeun98', '초으니', '서울특별시', '01087234922')
   , ('tgwon00', '태궈니', '서울특별시'  , '01053422914')
   , ('yoojin01', '유지니', '성남시', '01064534911')
   , ('hyojeong02', '효정이', '서울특별시', '01078890043')
   , ('boboo98', '보부', '성남시', '01045679023')
   , ('study00', '스터디', '성남시'  , '01023496780')
   , ('hhhello0', '헬로', '성남시', '01043296788')
   , ('bye012', '바이', '성남시', '01066234599')
   , ('jyj010530', '정유지니', '성남시', '01067239974')
   , ('jbs8307', '바스락', '성남시'  , '01034679976')
   , ('jyj3048', '악아아', '성남시', '01099328867')
   , ('jjy30480', '재재재', '성남시', '01078993288')
;